Revit 2027 API
RebarConstraintsManager Properties
The RebarConstraintsManager type exposes the following members.
Properties
Name | Description
IsRebarConstrainedPlacementEnabled | Obsolete.
 A static property defining that the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace